#import datetime
minute = ("минут", "минуты", "минута")
hour = ("часов", "часа")
d = {
    1:("одна", "одной", "час", "первого"),
    2:("две", "двух", "два", "второго"),
    3:("три", "трёх", "три", "третьего"),
    4:("четыре","четырёх","четыре", "четвертого"),
    5:("пять","пяти","пять", "пятого"),
    6:("шесть","шести","шесть", "шестого"),
    7:("семь","семи","семь", "седьмого"),
    8:("восемь","восьми","восемь", "восьмого"),
    9:("девять","девяти","девять", "девятого"),
    10:("десять","десяти","десять", "десятого"),
    11:("одинадцать", "одинадцати", "одинадцать", "одинадцатого"),
    12:("двенадцать", "двенадцати", "двенадцать", "двенадцатого"),
    13:("тринадцать", "тринадцати", "тринадцать", "тринадцатого"),
    14:("четырнадцать", "четырнадцати", "четырнадцать", "четырнадцатого"),
    15:("пятнадцать", "пятнадцати", "пятнадцать", "пятнадцатого"),
    16:("шестнадцать", "шестнадцати", "шестнадцать", "шестнадцатого"),
    17:("семнадцать", "семнадцати", "семнадцать", "семнадцатого"),
    18:("восемнадцать", "восемнадцати", "восемнадцать", "восемнадцатого"),
    19:("девятнадцать", "девятнадцати", "девятнадцать", "девятнадцатого"),
    20:("двадцать", "двадцати"),
    21:("двадцать одна","двадцать одной"),
    22:("двадцать два ", "двадцать две "),
    23:("двадцать три", "двадцать три"),
    24:("двадцать четыре"),
    25:("двадцать пять"),
    26:("двадцать шесть"),
    27:("двадцать семь"),
    28:("двадцать восемь"),
    29:("двадцать девять"),
    40:("сорок","сорока")
}
val = input("Do you want to type the time value yourself  (y/n)?\n")
if val == 'y':
   dat = input('Please enter your value in the hh:mm format\n')
# Переводим время в список
time = (dat.split(':'))
# Проверяем правильность ввода
if time[0].isdigit() == True and time[1].isdigit() == True and 0 <= int(time[0]) < 24 and 0 <= int(time[1]) < 60:

    hour, minute = int(time[0]), int(time[1])
    if minute == 0:
        if hour >= 2 and hour <=4:
            print(d[hour][0],'часа', end='.')
        else:
            print(d[hour][0],'часов', end='.')
        
    elif 0 < minute < 30:
        print('Ваше время', d[minute][0],'минут', d[(hour+1)][3] , end='.')
    elif minute == 30:
        print('Ваше время половина', d[(hour+1)][3] , end='.')
    elif 30 < minute < 45:
        print('Ваше время', d[minute][0],'минут', d[(hour+1)][0] , end='.')
    elif minute >= 45:
        print('Ваше время без', d[(60-minute)][1],'минут', d[(hour+1)][0], end='.')
else:
    print('Пожалуйста, проверьте правильность введенных данных.')


